app/views/trainings/_lesson_card.html.erb

SELECT "contents".* FROM "contents" WHERE "contents"."lesson_id" = $1  [["lesson_id", 1]]
---
<ul class="list-group list-group-flush">
  <% lesson.contents.each do |content| %>