app/views/trainings/edit_training_menu.html.erb

  <div class="lessons">
    <% @training.lessons.each do |lesson| %>
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."training_id" = $1  [["training_id", 6]]

        <ul class="list-group list-group-flush">
          <% lesson.contents.each do |content| %>
---
SELECT "contents".* FROM "contents" WHERE "contents"."lesson_id" = $1  [["lesson_id", 1]]