app/views/trainings/list.html.erb

        <div class="card-body">
          <button type="button" class="btn btn-primary total_lessons btn-sm">Lessons: <%= training.lessons.count %></button>
---
SELECT COUNT(*) FROM "lessons" WHERE "lessons"."training_id" = $1  [["training_id", 4]]