app/controllers/lessons_controller.rb

  def lesson_info
    @lesson = Lesson.find_by_id params[:lesson_id]
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]