app/controllers/trainings_controller.rb

  def create
    @training = Training.new(name: params[:training][:name], company: current_user.company)
    if @training.valid?
      # contact_email and to_h methods
      # left as an exercise to the reader
      @training.save
---
INSERT INTO "trainings" ("name", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Training 1"], ["company_id", 15], ["created_at", "2019-09-12 03:15:25.225122"], ["updated_at", "2019-09-12 03:15:25.225122"]]

  def edit_training_menu
    company = current_user.company
    @training = company.trainings.find params[:training_id]
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT  "trainings".* FROM "trainings" WHERE "trainings"."company_id" = $1 AND "trainings"."id" = $2 LIMIT $3  [["company_id", 15], ["id", 0], ["LIMIT", 1]]