app/controllers/users/registrations_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "company_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    form_data = params[:user]

    # Creating parent company before the user. This is necessary since the user must belong to a company
    @company = Company.create(name: form_data[:company])
    @company.save

    # Now we create the user
    @user = User.create(email: form_data[:email],
                        password: form_data[:password],
                        password_confirmation: form_data[:password_confirmation],
                        company_id: @company.id)